000100* FIND THE SUM OF ALL MULTIPLES OF 3 OR 5 BELOW 1000
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. EULER1.
000400* 
000500 DATA DIVISION.
000600     WORKING-STORAGE SECTION.
000700     01 WS-VALUE-INDEX INDEX.
000800     01 WS-X PIC 9(10) VALUE 0.
000900*     
001000     01 WS-START PIC 9(2).
001100     01 WS-CURRENT PIC 9(4).
001200     01 WS-TABLE.
001300     05 WS-VALUE PIC 9(4) VALUE 0 OCCURS 1000 TIMES INDEXED BY I.
001400* 
001500 PROCEDURE DIVISION.
001600     PERFORM A-PARA
001700         VARYING WS-START FROM 3 BY 2 UNTIL WS-START>5.
001800     PERFORM C-PARA VARYING WS-VALUE-INDEX FROM 1 BY 1 
001900         UNTIL WS-VALUE-INDEX >= 1000.
002000     DISPLAY "SOLUTION: "WS-X.
002100     STOP RUN.
002200*
002300     A-PARA.
002400     MOVE WS-START TO WS-CURRENT.
002500     PERFORM B-PARA UNTIL WS-CURRENT >= 1000.
002600*    
002700     B-PARA.
002800     SET I TO 1.
002900     SEARCH WS-VALUE
003000*        APPEND WS-CURRENT TO TABLE IF NOT FOUND IN TABLE
003100         AT END 
003200             MOVE WS-CURRENT TO WS-VALUE(WS-VALUE-INDEX)
003300*        OTHERWISE JUST CONTINUE
003400         WHEN WS-VALUE(I) = WS-CURRENT
003500             CONTINUE
003600     END-SEARCH.
003700     SET WS-VALUE-INDEX UP BY 1.
003800     ADD WS-START TO WS-CURRENT.
003900*
004000     C-PARA.
004100     COMPUTE WS-X = WS-X + WS-VALUE(WS-VALUE-INDEX).
004200*